
## Plan Result (aat)




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.pcs-api-s2s-secret
  * azurerm_key_vault_secret.pcs-frontend-s2s-secret
* Update
  * module.pcs_redis.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.pcs-api-s2s-secret will be created
  + resource "azurerm_key_vault_secret" "pcs-api-s2s-secret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcs-aat/providers/Microsoft.KeyVault/vaults/pcs-aat"
      + name                    = "pcs-api-s2s-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.pcs-frontend-s2s-secret will be created
  + resource "azurerm_key_vault_secret" "pcs-frontend-s2s-secret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcs-aat/providers/Microsoft.KeyVault/vaults/pcs-aat"
      + name                    = "pcs-frontend-s2s-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.pcs_redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcs-aat/providers/Microsoft.Cache/redis/pcs-aat"
        name                               = "pcs-aat"
        tags                               = {
            "application"         = "possession-claim-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pcs-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pcs-tech"
            "environment"         = "staging"
            "managedBy"           = "Possession Claim Service"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 125 -> 642
          ~ maxmemory_delta                         = 125 -> 642
          ~ maxmemory_reserved                      = 125 -> 642
            # (14 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":12,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->